// Даны два числа. Показать большее и меньшее число

int a = 9;
int b = 5;
int max = a;
int min = b;

if(a > b)
{
    Console.WriteLine("max=a, min=b");
}
else
{
Console.WriteLine("max=b, min=a");
}